* 
[[file:~/save/books/Beej's Guide to C Programming.html#how-to-read-this-book][Beej's Guide to C Programming]]

#+begin_src C++ :includes <stdio.h> <math.h>
    void newline(void)
    {
        printf("hello\n");
    }
  int main(){
      double pi = 3.1416;
      printf("sin(pi/2)=%f\nln1=%f\n", sin(pi/2), log(1.0));
    newline();
      int a=2;
      int b=3;
      int c=5;
      printf("%d\n", a+b+c);
      }
#+end_src

#+RESULTS:
| sin(pi/2)=1.000000 |
| ln1=0.000000      |
| hello             |
| 10               |
